<a href="https://colab.research.google.com/github/DrumDong/Donggyu/blob/master/pandas_melt.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Melt function
- Change an wide form dataframe to a long form dataframe

In [0]:
import pandas as pd

## upload dataframe

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/drive

In [0]:
exchange_mean = pd.read_csv('/content/drive/My Drive/Colab Notebooks/data/exchange_mean.csv',encoding='UTF8')

In [13]:
exchange_mean.head()

   Unnamed: 0    날짜          USD  ...         CNY          JPY          GBP
0           0  2001  1290.952174  ...  155.942208  1062.585613  1850.558246
1           1  2002  1252.868817  ...  153.808385  1003.021470  1870.015926
2           2  2003  1191.932530  ...    0.000000  1026.291667  1893.619104
3           3  2004  1144.197610  ...    0.000000  1049.830947  2096.455400
4           4  2005  1024.231587  ...    0.000000   931.660556  1876.077143

[5 rows x 7 columns]

In [14]:
exchange_mean=exchange_mean.drop(columns='Unnamed: 0')
exchange_mean.head()

     날짜          USD          EUR         CNY          JPY          GBP
0  2001  1290.952174  1158.577419  155.942208  1062.585613  1850.558246
1  2002  1252.868817  1180.836138  153.808385  1003.021470  1870.015926
2  2003  1191.932530  1347.370255    0.000000  1026.291667  1893.619104
3  2004  1144.197610  1421.162818    0.000000  1049.830947  2096.455400
4  2005  1024.231587  1266.103125    0.000000   931.660556  1876.077143

## Use 'MELT' to make a long form dataframe

- id_vars : 기준으로 잡을 컬럼
- value_vars : 컬럼값으로 넣을 컬럼들 (기준 잡힐 컬럼)
- var_name : value_vars를 가질 컬럼의 이름
- value_name : value_vars의 원래 컬럼값들

In [0]:
exchange_mean_longform=pd.melt(exchange_mean,
        id_vars=['날짜'],
        value_vars=['USD','EUR','CNY','JPY','GBP'],
        var_name='nation',
        value_name='exchange')

In [22]:
exchange_mean_longform.sort_values(['날짜'],ascending=True) #ascending: True:오름차순, False:내림차순

      날짜 nation     exchange
0   2001    USD  1290.952174
36  2001    CNY   155.942208
54  2001    JPY  1062.585613
18  2001    EUR  1158.577419
72  2001    GBP  1850.558246
..   ...    ...          ...
71  2018    JPY   996.034466
35  2018    EUR  1298.530959
17  2018    USD  1100.208493
53  2018    CNY   166.405699
89  2018    GBP  1467.954685

[90 rows x 3 columns]